IsCallout Property
 Indicates if the view is a callout view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  Since:  2022
 Syntax
  C#
public bool IsCallout { get; }
  Visual Basic
Public ReadOnly Property IsCallout As Boolean
	Get
  Visual C++
public:
property bool IsCallout {
	bool get ();
}
 Remarks
 Reference callouts are not treated as callout views. The view was created as a callout in its parent view but it may show as a section in orthogonal views.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →